# 路飞决定根据销售额给员工发提成，提成为阶梯制，假设一个销售人员基本工资为3000元，每月业绩低于5万元，无提成；5万至10万，
# 提成3%；10万至15万提成5%，15万-25万提成8%；25万至35万提成10%，35万以上，提成15%；从键盘获取用户当月业绩，
# 计算其工资+提成的总额。

base = 3000
sale = int(input("本月业绩:"))

# 此处设置5个销售lvl区分节点p0-p4，5个节点可以区分出6个区域；
p0 = 50000
p1 = 100000
p2 = 150000
p3 = 250000
p4 = 350000

# 此处设置5个销售提成点数，分别对应5个区域，其中第一区域即p0以下不分配点数；
r1 = 0.03
r2 = 0.05
r3 = 0.08
r4 = 0.10
r5 = 0.15

# 此处计算前4个存在销售提成的提成金额的最大数目max1-max4，用于后面计算简便清晰,最高区上不封顶，因此不在此计算；
max1 = (p1 - p0) * r1
max2 = (p2 - p1) * r2 + max1
max3 = (p3 - p2) * r3 + max2
max4 = (p4 - p3) * r4 + max3

# 此处正式开始区分销售业绩档位，并配以提成计算结果bonus；
if 0 <= sale <= p0:
    bonus = 0

elif p0 < sale <= p1:
    bonus = (sale - p0) * r1

elif p1 < sale <= p2:
    bonus = max1 + (sale - p1) * r2

elif p2 < sale <= p3:
    bonus = max2 + (sale - p2) * r3

elif p3 < sale <= p4:
    bonus = max3 + (sale - p3) * r4

else:
    bonus = max4 + (sale - p4) * r5

print(base + bonus)
